cases/artigo_mestrado/on-caso-1.2/_grid/P2000_d1e15_neohooke/fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

// on-caso-1: Two-way FSI nas 2 patches FSI restantes (fsi_pia, fsi_dura).
// O lid poroso e' uma extensao rigida do fluido (lid_wall_inner/outer
// estacionarios); o motion solver displacementLaplacian propaga o
// deslocamento das 2 paredes FSI para o interior com diffusivity
// quadratic inverseDistance.

dynamicFvMesh           dynamicMotionSolverFvMesh;

motionSolverLibs        ( "libfvMotionSolvers.so" );

"solver|motionSolver"   displacementLaplacian;

diffusivity             quadratic inverseDistance 2 ( fsi_pia fsi_dura );
